app/views/roles/index.html.erb

SELECT "roles".* FROM "roles" WHERE "roles"."actor_id" = ?  [["actor_id", 3]]
---

<% @actor.roles.each do |role| %>