app/views/roles/new.html.erb

  <%= f.label :Movie %>
  <div><%= f.collection_select :movie_ids, Movie.all, :id, :title, prompt: true %></div>
---
SELECT "movies".* FROM "movies"