app/controllers/actors_controller.rb

INSERT INTO "actors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Kevin Hart"], ["created_at", "2020-03-05 19:53:27.348521"], ["updated_at", "2020-03-05 19:53:27.348521"]]
---
  def create
    @actor = Actor.new(actor_params)
    if @actor.save