app/controllers/movies_controller.rb

  def index
    if params[:search]
      @movies = Movie.all.where(title: params[:search])
      else
        @movies = Movie.all
---
SELECT "movies".* FROM "movies"