app/controllers/roles_controller.rb

SELECT "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "roles" ("movie_id", "actor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["movie_id", 1], ["actor_id", 4], ["created_at", "2020-03-06 05:39:25.429117"], ["updated_at", "2020-03-06 05:39:25.429117"]]
---
  def create
    @actor = Actor.find_by(id: params[:role][:actor_id])
    if user_authorized?
      @role = Role.new(role_params)
      if @role.save

SELECT "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def destroy
    Actor.find_by(id: params[:id]).destroy